# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, same,_], #0
   [-1, 1, cut_first, _], #1-RGB 640*640*3
   [0, 1, cut_second, _], #2-DEPTH
   [1, 1, Conv, [64, 6, 2, 2]],  # 3-P1 [output,kernel size, padding]
   [2, 1, Conv, [64, 6, 2, 2]],
   [3, 1, Conv, [128, 3, 2]],  # 5-P2
   [4, 1, Conv, [128, 3, 2]],
   [5, 3, C3, [128]],
   [6, 3, C3, [128]],
   [7, 1, Conv, [256, 3, 2]],  # 9
   [8, 1, Conv, [256, 3, 2]],
   [9, 6, C3, [256]],
   [10, 6, C3, [256]],
   [[11,12], 1, CSFM, [256]],   # 13-P3 RGBD 80*80*256
   [-1, 1, Conv, [512, 3, 2]],  # 14
   [12, 1, Conv, [512, 3, 2]],
   [14, 9, C3, [512]],
   [15, 9, C3, [512]],
   [[16,17], 1, CSFM, [512]],   # 18-P4 RGBD 40*40*512
   [-1, 1, Conv, [1024, 3, 2]],  # 19
   [17, 1, Conv, [1024, 3, 2]],
   [19, 3, C3, [1024]],
   [20, 3, C3, [1024]],
   [[21,22], 1, CSFM, [1024]],   # 23 RGBD 20*20*1024
   [-1, 1, SPPF, [1024, 5]],  # 24
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]], #25-HP5
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 18], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 28

   [-1, 1, Conv, [256, 1, 1]], # 29-HP4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 13], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 32-HP3

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 29], 1, Concat, [1]],  # cat head HP4
   [-1, 3, C3, [512, False]],  # 35

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 25], 1, Concat, [1]],  # cat head HP5
   [-1, 3, C3, [1024, False]],  # 38

   [[32, 35, 38], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
